* use mermaid for the diagram  * remove version list now this on the home page
