--- a/adif-processor/adif-processor.md
+++ b/adif-processor/adif-processor.md
@@ -75,21 +77,14 @@ is detecting errors in callsigns and activity references (e.g. POTA or SOTA refe
 
 A high-level overview of the process is shown below:
 
-```
-            ┌─────────────┐
-            │ ADIF or CSV │
-            └─────────────┘
-                   ↓
- ┌───────────────────────────────────┐   ┌────────┐
- │               ADIF                │ ← │ Form   │
- │             Processor             │   │ Options│
- └───────────────────────────────────┘   └────────┘
-    ↓         ↓         ↓         ↓
-┌──────┐  ┌──────┐  ┌──────┐  ┌──────┐
-│ ADIF │  │ KML  │  │  MD  │  │ TXT  │
-└──────┘  └──────┘  └──────┘  └──────┘
-Augmented  Google   Markdown  QSL Labels
-  ADIF     Earth     Table   for Printing
+```mermaid
+flowchart TD
+    A[Input File] --> |ADIF/CSV| B(ADIF Processor)
+    B --> |KML| D[Google Earth]
+    B --> |ADIF| C[Augmented ADIF]
+    B --> |MD| E[Markdown]
+    B --> |TXT| F[QSL Labels]
+    G[Form Options] --> B
 ```
 
 The processor also produces a [Markdown](https://www.markdownguide.org/) format contact table
